/*
 Copyright (c) 1993-2008, Cognitive Technologies
 All rights reserved.

 Разрешается повторное распространение и использование как в виде исходного кода,
 так и в двоичной форме, с изменениями или без, при соблюдении следующих условий:

 * При повторном распространении исходного кода должны оставаться указанное
 выше уведомление об авторском праве, этот список условий и последующий
 отказ от гарантий.
 * При повторном распространении двоичного кода в документации и/или в
 других материалах, поставляемых при распространении, должны сохраняться
 указанная выше информация об авторском праве, этот список условий и
 последующий отказ от гарантий.
 * Ни название Cognitive Technologies, ни имена ее сотрудников не могут
 быть использованы в качестве средства поддержки и/или продвижения
 продуктов, основанных на этом ПО, без предварительного письменного
 разрешения.

 ЭТА ПРОГРАММА ПРЕДОСТАВЛЕНА ВЛАДЕЛЬЦАМИ АВТОРСКИХ ПРАВ И/ИЛИ ДРУГИМИ ЛИЦАМИ "КАК
 ОНА ЕСТЬ" БЕЗ КАКОГО-ЛИБО ВИДА ГАРАНТИЙ, ВЫРАЖЕННЫХ ЯВНО ИЛИ ПОДРАЗУМЕВАЕМЫХ,
 ВКЛЮЧАЯ ГАРАНТИИ КОММЕРЧЕСКОЙ ЦЕННОСТИ И ПРИГОДНОСТИ ДЛЯ КОНКРЕТНОЙ ЦЕЛИ, НО НЕ
 ОГРАНИЧИВАЯСЬ ИМИ. НИ ВЛАДЕЛЕЦ АВТОРСКИХ ПРАВ И НИ ОДНО ДРУГОЕ ЛИЦО, КОТОРОЕ
 МОЖЕТ ИЗМЕНЯТЬ И/ИЛИ ПОВТОРНО РАСПРОСТРАНЯТЬ ПРОГРАММУ, НИ В КОЕМ СЛУЧАЕ НЕ
 НЕСЁТ ОТВЕТСТВЕННОСТИ, ВКЛЮЧАЯ ЛЮБЫЕ ОБЩИЕ, СЛУЧАЙНЫЕ, СПЕЦИАЛЬНЫЕ ИЛИ
 ПОСЛЕДОВАВШИЕ УБЫТКИ, СВЯЗАННЫЕ С ИСПОЛЬЗОВАНИЕМ ИЛИ ПОНЕСЕННЫЕ ВСЛЕДСТВИЕ
 НЕВОЗМОЖНОСТИ ИСПОЛЬЗОВАНИЯ ПРОГРАММЫ (ВКЛЮЧАЯ ПОТЕРИ ДАННЫХ, ИЛИ ДАННЫЕ,
 СТАВШИЕ НЕГОДНЫМИ, ИЛИ УБЫТКИ И/ИЛИ ПОТЕРИ ДОХОДОВ, ПОНЕСЕННЫЕ ИЗ-ЗА ДЕЙСТВИЙ
 ТРЕТЬИХ ЛИЦ И/ИЛИ ОТКАЗА ПРОГРАММЫ РАБОТАТЬ СОВМЕСТНО С ДРУГИМИ ПРОГРАММАМИ,
 НО НЕ ОГРАНИЧИВАЯСЬ ЭТИМИ СЛУЧАЯМИ), НО НЕ ОГРАНИЧИВАЯСЬ ИМИ, ДАЖЕ ЕСЛИ ТАКОЙ
 ВЛАДЕЛЕЦ ИЛИ ДРУГОЕ ЛИЦО БЫЛИ ИЗВЕЩЕНЫ О ВОЗМОЖНОСТИ ТАКИХ УБЫТКОВ И ПОТЕРЬ.

 Redistribution and use in source and binary forms, with or without modification,
 are permitted provided that the following conditions are met:

 * Redistributions of source code must retain the above copyright notice,
 this list of conditions and the following disclaimer.
 * Redistributions in binary form must reproduce the above copyright notice,
 this list of conditions and the following disclaimer in the documentation
 and/or other materials provided with the distribution.
 * Neither the name of the Cognitive Technologies nor the names of its
 contributors may be used to endorse or promote products derived from this
 software without specific prior written permission.

 THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT OWNER OR CONTRIBUTORS BE LIABLE
 FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
 DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
 SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
 CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
 OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
 OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "cttypes.h"

/****************************************************************/
/* DISKRTAB.H - таблицы для байтовых операций           */
/****************************************************************/
/* количество интервалов в байте    - piece_cnt         */
/* количество бит в байте           - bit_cnt           */
/* номер первого слева бита         - start_pos         */
/* номер первого справа бита        - last_pos          */
/* маска для зануления левых битов  - mask_l            */
/* маска для зануления правых битов - mask_r            */
/* маска для выделения  бита        - mask_byte         */
/* развернуть 4 бита в DWORD        - tab_4bits_to_DWORD    */
/* номер последнего черного бита                */
/* в первой слева пачке битов       - tab_last_black_bit    */
/****************************************************************/

namespace cf {
namespace dif {

/* количество интервалов в байте        */
/* piece_cnt[ 5=0x05=0b00000101 ] = 2 интервала */
uchar piece_cnt[] = {
    0, 1, 1, 1, 1, 2, 1, 1, 1, 2, 2, 2, 1, 2, 1, 1,
    1, 2, 2, 2, 2, 3, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    2, 3, 3, 3, 3, 4, 3, 3, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    2, 3, 3, 3, 3, 4, 3, 3, 2, 3, 3, 3, 2, 3, 2, 2,
    2, 3, 3, 3, 3, 4, 3, 3, 3, 4, 4, 4, 3, 4, 3, 3,
    2, 3, 3, 3, 3, 4, 3, 3, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    2, 3, 3, 3, 3, 4, 3, 3, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 2, 3, 3, 3, 2, 3, 2, 2,
    1, 2, 2, 2, 2, 3, 2, 2, 1, 2, 2, 2, 1, 2, 1, 1
};

/* количество бит в байте       */
/* bit_cnt[ 15=0x0F=0b00001111 ] = 4    */
uchar bit_cnt[] = {
    0, 1, 1, 2, 1, 2, 2, 3,
    1, 2, 2, 3, 2, 3, 3, 4,
    1, 2, 2, 3, 2, 3, 3, 4,
    2, 3, 3, 4, 3, 4, 4, 5,
    1, 2, 2, 3, 2, 3, 3, 4,
    2, 3, 3, 4, 3, 4, 4, 5,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    1, 2, 2, 3, 2, 3, 3, 4,
    2, 3, 3, 4, 3, 4, 4, 5,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    3, 4, 4, 5, 4, 5, 5, 6,
    4, 5, 5, 6, 5, 6, 6, 7,
    1, 2, 2, 3, 2, 3, 3, 4,
    2, 3, 3, 4, 3, 4, 4, 5,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    3, 4, 4, 5, 4, 5, 5, 6,
    4, 5, 5, 6, 5, 6, 6, 7,
    2, 3, 3, 4, 3, 4, 4, 5,
    3, 4, 4, 5, 4, 5, 5, 6,
    3, 4, 4, 5, 4, 5, 5, 6,
    4, 5, 5, 6, 5, 6, 6, 7,
    3, 4, 4, 5, 4, 5, 5, 6,
    4, 5, 5, 6, 5, 6, 6, 7,
    4, 5, 5, 6, 5, 6, 6, 7,
    5, 6, 6, 7, 6, 7, 7, 8
};

/* номер первого слева бита в байте     */
/* start_pos[ 27=0x1B=0b00011011 ] = 3  */
uchar start_pos[] = {
    8,
    7,
    6, 6,                   /* 2 dup (6) */
    5, 5, 5, 5,             /* 4 dup (5) */
    4, 4, 4, 4, 4, 4, 4, 4,     /* 8 dup (4) */
    3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3, 3,    /* 16 dup (3)*/
    2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,
    2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2,    /* 32 dup (2)*/
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,
    1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1, 1,    /* 64 dup (1)*/
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
    0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0     /* 128 dup (0)*/
};

/* номер первого справа бита в байте    */
/* last_pos[ 56=0x38=0x00111000 ] = 3   */
uchar last_pos[] = {
    8,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    5,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    6,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    5,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    7,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    5,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    6,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    5,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    4,
    0, 1, 0,
    2,
    0, 1, 0,
    3,
    0, 1, 0,
    2,
    0, 1, 0,
    7
};


/* маска для зануления левых битов  */
/* mask_l[3] = 31 = 0x1F = 0b00011111   */
uchar mask_l[]   = { 255, 127,  63,  31,  15,   7,   3,   1};

/* маска для зануления правых битов     */
/* mask_r[5] = 248 = 0xF8 = 0b11111000  */
uchar mask_r[]   = {   0, 128, 192, 224, 240, 248, 252, 254};

/* маска для выделения бита         */
/* mask_byte[4] = 8 = 0x08 = 0b00001000 */
uchar mask_byte[] = { 128,  64,  32,  16,   8,   4,   2,   1};

/* развернуть 4 бита в 4 байта в порядке следования байтов типа int32_t */
uint32_t tab_4bits_to_DWORD[] = {
    0x00000000l,
    0x01000000l,
    0x00010000l,
    0x01010000l,
    0x00000100l,
    0x01000100l,
    0x00010100l,
    0x01010100l,
    0x00000001l,
    0x01000001l,
    0x00010001l,
    0x01010001l,
    0x00000101l,
    0x01000101l,
    0x00010101l,
    0x01010101l
};

/* найти номер последнего черного бита в    */
/* первом слева пакете черных битов     */
uint16_t tab_last_black_bit[] = {
    0,   7,   6,   7,   5,   5,   6,   7,   4,   4,   4,   4,   5,   5,   6,   7,
    3,   3,   3,   3,   3,   3,   3,   3,   4,   4,   4,   4,   5,   5,   6,   7,
    2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,
    3,   3,   3,   3,   3,   3,   3,   3,   4,   4,   4,   4,   5,   5,   6,   7,
    1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
    1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
    2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,
    3,   3,   3,   3,   3,   3,   3,   3,   4,   4,   4,   4,   5,   5,   6,   7,
    0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,   0,
    1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
    1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,   1,
    2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,   2,
    3,   3,   3,   3,   3,   3,   3,   3,   4,   4,   4,   4,   5,   5,   6,   7
};

}
}
